from dataclasses import dataclass
import numpy as np

@dataclass(frozen=True)
class SignalParameters:
    """
    Хранит все параметры для генерации и анализа сигнала L1OC.
    frozen=True делает объект неизменяемым, что предотвращает случайные ошибки.
    """
    
    f_t1: float = 1.023e6  # Базовая тактовая частота PRN, Гц
    f_t2: float = 2.5575e6 # Ширина главного лепестка, Гц
    svn: int = 14          # Системный номер НКА (спутника)
    duration: float = 0.02 # Длительность сигнала, с

    
    sampling_rate: float = 4 * f_t2              # Частота дискретизации, Гц
    intermediate_freq: float = sampling_rate / 4 # Промежуточная частота, Гц
    
   
    nav_data_rate: float = 125.0    # Скорость передачи данных, бит/с
    overlay_rate: float = 500.0     # Скорость оверлейного кода, сим/с
    
    # Параметры TDM (DPPP)
    tdm_pattern: tuple = (1, 0, 0, 0) # 1 - данные, 0 - пилот

    # Параметры анализа
    welch_nperseg: int = 4096 # Размер окна для метода Уэлча

    # Параметры для проведения проверки (тест)
    table_prn_d_first=np.array([0,1,1,0,0,0,1,1,0,0,1,0,0,1,1,0,0,0,0,1,0,1,0,0,1,1,0,0,1,1,1,0])
    table_prn_d_end=np.array([0,1,0,0,1,1,1,0,0,1,1,0,1,1,0,0,1,0,0,0,0,1,0,0,0,1,1,1,1,1,0,1])
    table_prn_p_first=np.array([1,1,0,1,0,0,1,0,0,1,1,1,1,0,0,0,0,0,0,1,0,0,1,0,0,0,1,0,1,0,1,1])
    table_prn_p_end=np.array([1,1,0,1,1,1,0,1,1,0,1,1,1,1,1,1,0,0,1,0,0,0,0,0,0,1,1,0,0,0,1,0])